# Lambda Functions

### Preliminary Stuff

In [1]:
# The following modules are used for plotting and generating data
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd
%matplotlib inline

In [2]:
# import the dataset
df = pd.read_csv('data/titanic.csv')
df.tail(3)

     Survived  Pclass     Sex   Age   Fare     Embarked
709         1       1  female  19.0  30.00  Southampton
710         1       1    male  26.0  30.00    Cherbourg
711         0       3    male  32.0   7.75   Queenstown

In [3]:
# Remember list comprehension? Well, lambda functions are kind of like that.
mylist = [x**2 for x in range(0,8)] 
mylist # Square numbers in range and turn into list

[0, 1, 4, 9, 16, 25, 36, 49]

### How to build a lambda function

In [4]:
# Lets slowly break down a lambda expression by deconstructing a function

In [5]:
# Simple squaring function:
def square(num):
    result = num**2
    return result
square(4)

16

In [6]:
# We could simplify that:
def square(num):
    return num**2
square(3)

9

In [7]:
# We could actually even write this all on one line.
def square(num): return num**2
square(7)

49

In [8]:
# Let's get rid of the 'def' altogether.
square = lambda num: num **2
square(6)

36

In [9]:
# But why even bother to name it?
lambda num: num **2

In [10]:
# When would we ever use this? Well, for repeated tasks:
pipeline = [lambda num: num +2,
            lambda num: num *2,
            lambda num: num **2]

for element in pipeline:
    print(element(7))

9
14
49

In [11]:
# Now you try!

## Let's combine this with a pandas dataframe.

In [12]:
# Define a simple function.

def childish(years):
    if years<18:
        return True
    else:
        return False
childish(19)

False

In [13]:
# Apply it to every row in the df.
df['Is_Minor'] = df['Age'].apply(childish)
df.head(7)

   Survived  Pclass     Sex   Age     Fare     Embarked  Is_Minor
0         0       3    male  22.0   7.2500  Southampton     False
1         1       1  female  38.0  71.2833    Cherbourg     False
2         1       3  female  26.0   7.9250  Southampton     False
3         1       1  female  35.0  53.1000  Southampton     False
4         0       3    male  35.0   8.0500  Southampton     False
5         0       1    male  54.0  51.8625  Southampton     False
6         0       3    male   2.0  21.0750  Southampton      True

In [14]:
# Do this using a lambda expression:
df['Is_Minor_3'] = df['Age'].apply(lambda row: False if row < 18 else True)
df.head(7)

   Survived  Pclass     Sex   Age     Fare     Embarked  Is_Minor  Is_Minor_3
0         0       3    male  22.0   7.2500  Southampton     False        True
1         1       1  female  38.0  71.2833    Cherbourg     False        True
2         1       3  female  26.0   7.9250  Southampton     False        True
3         1       1  female  35.0  53.1000  Southampton     False        True
4         0       3    male  35.0   8.0500  Southampton     False        True
5         0       1    male  54.0  51.8625  Southampton     False        True
6         0       3    male   2.0  21.0750  Southampton      True       False

In [15]:
# And of course, there's a more elegant way to write this boolean:
df['Is_Minor_3'] = df['Age'].apply(lambda row: row < 18)
df.head(7)

   Survived  Pclass     Sex   Age     Fare     Embarked  Is_Minor  Is_Minor_3
0         0       3    male  22.0   7.2500  Southampton     False       False
1         1       1  female  38.0  71.2833    Cherbourg     False       False
2         1       3  female  26.0   7.9250  Southampton     False       False
3         1       1  female  35.0  53.1000  Southampton     False       False
4         0       3    male  35.0   8.0500  Southampton     False       False
5         0       1    male  54.0  51.8625  Southampton     False       False
6         0       3    male   2.0  21.0750  Southampton      True        True

In [16]:
# Now you try!

Additional Resource:  
    https://chrisalbon.com/python/basics/lambda_functions/

![dicaprio](source_material/titanic-movie.jpg)